<a href="https://colab.research.google.com/github/srfinley/DS-Unit-1-Sprint-2-Data-Wrangling-and-Storytelling/blob/master/module1-join-and-reshape-data/LS_DS_121_Join_and_Reshape_Data_Assignment.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

_Lambda School Data Science_

# Join and Reshape datasets

Objectives
- concatenate data with pandas
- merge data with pandas
-  understand tidy data formatting
-  melt and pivot data with pandas

Links
- [Pandas Cheat Sheet](https://github.com/pandas-dev/pandas/blob/master/doc/cheatsheet/Pandas_Cheat_Sheet.pdf)
- [Tidy Data](https://en.wikipedia.org/wiki/Tidy_data)
  - Combine Data Sets: Standard Joins
  - Tidy Data
  - Reshaping Data
- Python Data Science Handbook
  - [Chapter 3.6](https://jakevdp.github.io/PythonDataScienceHandbook/03.06-concat-and-append.html), Combining Datasets: Concat and Append
  - [Chapter 3.7](https://jakevdp.github.io/PythonDataScienceHandbook/03.07-merge-and-join.html), Combining Datasets: Merge and Join
  - [Chapter 3.8](https://jakevdp.github.io/PythonDataScienceHandbook/03.08-aggregation-and-grouping.html), Aggregation and Grouping
  - [Chapter 3.9](https://jakevdp.github.io/PythonDataScienceHandbook/03.09-pivot-tables.html), Pivot Tables
  
Reference
- Pandas Documentation: [Reshaping and Pivot Tables](https://pandas.pydata.org/pandas-docs/stable/reshaping.html)
- Modern Pandas, Part 5: [Tidy Data](https://tomaugspurger.github.io/modern-5-tidy.html)

In [1]:
!wget https://s3.amazonaws.com/instacart-datasets/instacart_online_grocery_shopping_2017_05_01.tar.gz

--2019-09-09 19:13:57--  https://s3.amazonaws.com/instacart-datasets/instacart_online_grocery_shopping_2017_05_01.tar.gz
Resolving s3.amazonaws.com (s3.amazonaws.com)... 52.216.106.21
Connecting to s3.amazonaws.com (s3.amazonaws.com)|52.216.106.21|:443... connected.
HTTP request sent, awaiting response... 200 OK
Length: 205548478 (196M) [application/x-gzip]
Saving to: ‘instacart_online_grocery_shopping_2017_05_01.tar.gz’

instacart_online_gr 100%[===================>] 196.03M  96.3MB/s    in 2.0s

2019-09-09 19:13:59 (96.3 MB/s) - ‘instacart_online_grocery_shopping_2017_05_01.tar.gz’ saved [205548478/205548478]

In [2]:
!tar --gunzip --extract --verbose --file=instacart_online_grocery_shopping_2017_05_01.tar.gz

instacart_2017_05_01/
instacart_2017_05_01/._aisles.csv
instacart_2017_05_01/aisles.csv
instacart_2017_05_01/._departments.csv
instacart_2017_05_01/departments.csv
instacart_2017_05_01/._order_products__prior.csv
instacart_2017_05_01/order_products__prior.csv
instacart_2017_05_01/._order_products__train.csv
instacart_2017_05_01/order_products__train.csv
instacart_2017_05_01/._orders.csv
instacart_2017_05_01/orders.csv
instacart_2017_05_01/._products.csv
instacart_2017_05_01/products.csv

In [3]:
%cd instacart_2017_05_01

/content/instacart_2017_05_01

In [4]:
!ls -lh *.csv

-rw-r--r-- 1 502 staff 2.6K May  2  2017 aisles.csv
-rw-r--r-- 1 502 staff  270 May  2  2017 departments.csv
-rw-r--r-- 1 502 staff 551M May  2  2017 order_products__prior.csv
-rw-r--r-- 1 502 staff  24M May  2  2017 order_products__train.csv
-rw-r--r-- 1 502 staff 104M May  2  2017 orders.csv
-rw-r--r-- 1 502 staff 2.1M May  2  2017 products.csv

In [0]:
import pandas as pd

# Assignment

## Join Data Practice

These are the top 10 most frequently ordered products. How many times was each ordered? 

1. Banana
2. Bag of Organic Bananas
3. Organic Strawberries
4. Organic Baby Spinach 
5. Organic Hass Avocado
6. Organic Avocado
7. Large Lemon 
8. Strawberries
9. Limes 
10. Organic Whole Milk

First, write down which columns you need and which dataframes have them.

Next, merge these into a single dataframe.

Then, use pandas functions from the previous lesson to get the counts of the top 10 most frequently ordered products.

In [0]:
#from products.csv...
#product_name
#product_id
#from order_products__prior and __train...
#order id
#product_id

#first, concat __prior and __train

order_products__prior = pd.read_csv('order_products__prior.csv')
order_products__train = pd.read_csv('order_products__train.csv')

In [8]:
order_products = pd.concat([order_products__prior, order_products__train])
print(order_products.shape) #correct length, as in the lecture example
order_products.head()

(33819106, 4)

   order_id  product_id  add_to_cart_order  reordered
0         2       33120                  1          1
1         2       28985                  2          1
2         2        9327                  3          0
3         2       45918                  4          1
4         2       30035                  5          0

In [11]:
#add to cart order and reordered are not needed

order_products = order_products.drop(axis=1,labels=['add_to_cart_order','reordered'])

order_products.head()

   order_id  product_id
0         2       33120
1         2       28985
2         2        9327
3         2       45918
4         2       30035

In [12]:
#now to add product names to each row according to the product id

#first, get the csv

products = pd.read_csv('products.csv')
products.head()

   product_id  ... department_id
0           1  ...            19
1           2  ...            13
2           3  ...             7
3           4  ...             1
4           5  ...            13

[5 rows x 4 columns]

In [13]:
#we don't need the aisle id or department id

products = products.drop(axis=1,labels=['aisle_id','department_id'])
products.head()

   product_id                                       product_name
0           1                         Chocolate Sandwich Cookies
1           2                                   All-Seasons Salt
2           3               Robust Golden Unsweetened Oolong Tea
3           4  Smart Ones Classic Favorites Mini Rigatoni Wit...
4           5                          Green Chile Anytime Sauce

In [15]:
#actually, it'll be faster to focus on the top products first, so let's generate that list

top_ten = order_products['product_id'].value_counts().head(10)
top_ten

24852    491291
13176    394930
21137    275577
21903    251705
47209    220877
47766    184224
47626    160792
16797    149445
26209    146660
27845    142813
Name: product_id, dtype: int64

In [17]:
#make the top ten list into a proper dataframe with correct headers
top_ten = top_ten.reset_index()
top_ten.columns = ['product_id','count']
top_ten

   product_id   count
0       24852  491291
1       13176  394930
2       21137  275577
3       21903  251705
4       47209  220877
5       47766  184224
6       47626  160792
7       16797  149445
8       26209  146660
9       27845  142813

In [18]:
#merge top_ten and products!

merged = pd.merge(top_ten, products, how='inner', on='product_id')

merged

#and now we have counts for each of the top ten!!

   product_id   count            product_name
0       24852  491291                  Banana
1       13176  394930  Bag of Organic Bananas
2       21137  275577    Organic Strawberries
3       21903  251705    Organic Baby Spinach
4       47209  220877    Organic Hass Avocado
5       47766  184224         Organic Avocado
6       47626  160792             Large Lemon
7       16797  149445            Strawberries
8       26209  146660                   Limes
9       27845  142813      Organic Whole Milk

## Reshape Data Section

- Replicate the lesson code
- Complete the code cells we skipped near the beginning of the notebook
- Table 2 --> Tidy
- Tidy --> Table 2
- Load seaborn's `flights` dataset by running the cell below. Then create a pivot table showing the number of passengers by month and year. Use year for the index and month for the columns. You've done it right if you get 112 passengers for January 1949 and 432 passengers for December 1960.

In [0]:
#replicated from lesson

%matplotlib inline
#import pandas as pd
import numpy as np
import seaborn as sns

table1 = pd.DataFrame(
    [[np.nan, 2],
     [16,    11], 
     [3,      1]],
    index=['John Smith', 'Jane Doe', 'Mary Johnson'], 
    columns=['treatmenta', 'treatmentb'])

table2 = table1.T

In [31]:
table2

            John Smith  Jane Doe  Mary Johnson
treatmenta         NaN      16.0           3.0
treatmentb         2.0      11.0           1.0

In [32]:
#Table 2 --> Tidy

#pull treatment out of the index
table2 = table2.reset_index()
table2

        index  John Smith  Jane Doe  Mary Johnson
0  treatmenta         NaN      16.0           3.0
1  treatmentb         2.0      11.0           1.0

In [33]:
tidy = table2.melt(id_vars="index")
tidy #looks tidy!

        index      variable  value
0  treatmenta    John Smith    NaN
1  treatmentb    John Smith    2.0
2  treatmenta      Jane Doe   16.0
3  treatmentb      Jane Doe   11.0
4  treatmenta  Mary Johnson    3.0
5  treatmentb  Mary Johnson    1.0

In [34]:
#just for fun, let's replicate the de-stupidification of the data that Ryan did in lecture

tidy = tidy.rename(columns={
    'index': 'trt', 
    'variable': 'name', 
    'value': 'result'
})

tidy.trt = tidy.trt.str.replace('treatment', '')

tidy

  trt          name  result
0   a    John Smith     NaN
1   b    John Smith     2.0
2   a      Jane Doe    16.0
3   b      Jane Doe    11.0
4   a  Mary Johnson     3.0
5   b  Mary Johnson     1.0

In [37]:
#Tidy --> Table 2

wide = tidy.pivot_table(index="trt",columns="name",values="result")

wide

name  Jane Doe  John Smith  Mary Johnson
trt
a         16.0         NaN           3.0
b         11.0         2.0           1.0

In [0]:
#Load seaborn's flights dataset by running the cell below. 
flights = sns.load_dataset('flights')

In [39]:
flights.head()

   year     month  passengers
0  1949   January         112
1  1949  February         118
2  1949     March         132
3  1949     April         129
4  1949       May         121

In [40]:
#create a pivot table showing the number of passengers by month and year. 
#Use year for the index and month for the columns. 
#You've done it right if you get 112 passengers for January 1949 and 432 passengers for December 1960.

pivot = flights.pivot_table(index="year",columns="month",values="passengers")
pivot
#what a superb example of a time to pivot! I love it!

month  January  February  March  April  ...  September  October  November  December
year                                    ...
1949       112       118    132    129  ...        136      119       104       118
1950       115       126    141    135  ...        158      133       114       140
1951       145       150    178    163  ...        184      162       146       166
1952       171       180    193    181  ...        209      191       172       194
1953       196       196    236    235  ...        237      211       180       201
1954       204       188    235    227  ...        259      229       203       229
1955       242       233    267    269  ...        312      274       237       278
1956       284       277    317    313  ...        355      306       271       306
1957       315       301    356    348  ...        404      347       305       336
1958       340       318    362    348  ...        404      359       310       337
1959       360       342    406    396  ...        463      407       362       405
1960       417       391    419    461  ...        508      461       390       432

[12 rows x 12 columns]

## Join Data Stretch Challenge

The [Instacart blog post](https://tech.instacart.com/3-million-instacart-orders-open-sourced-d40d29ead6f2) has a visualization of "**Popular products** purchased earliest in the day (green) and latest in the day (red)." 

The post says,

> "We can also see the time of day that users purchase specific products.

> Healthier snacks and staples tend to be purchased earlier in the day, whereas ice cream (especially Half Baked and The Tonight Dough) are far more popular when customers are ordering in the evening.

> **In fact, of the top 25 latest ordered products, the first 24 are ice cream! The last one, of course, is a frozen pizza.**"

Your challenge is to reproduce the list of the top 25 latest ordered popular products.

We'll define "popular products" as products with more than 2,900 orders.

In [41]:
from IPython.display import display, Image
url = 'https://cdn-images-1.medium.com/max/1600/1*wKfV6OV-_1Ipwrl7AjjSuw.png'
example = Image(url=url, width=600)

display(example)

## Reshape Data Stretch Challenge

_Try whatever sounds most interesting to you!_

- Replicate more of Instacart's visualization showing "Hour of Day Ordered" vs "Percent of Orders by Product"
- Replicate parts of the other visualization from [Instacart's blog post](https://tech.instacart.com/3-million-instacart-orders-open-sourced-d40d29ead6f2), showing "Number of Purchases" vs "Percent Reorder Purchases"
- Get the most recent order for each user in Instacart's dataset. This is a useful baseline when [predicting a user's next order](https://www.kaggle.com/c/instacart-market-basket-analysis)
- Replicate parts of the blog post linked at the top of this notebook: [Modern Pandas, Part 5: Tidy Data](https://tomaugspurger.github.io/modern-5-tidy.html)

In [0]:
#https://tomaugspurger.github.io/modern-5-tidy.html
#"How many days of rest did each team get between each game?"

tables = pd.read_html("http://www.basketball-reference.com/leagues/NBA_2016_games.html")

In [44]:
tables[0].head()

                Date Start (ET)  ... Attend.  Notes
0  Fri, Oct 30, 2015      7:00p  ...   17122    NaN
1  Fri, Oct 30, 2015      7:00p  ...   20562    NaN
2  Fri, Oct 30, 2015      7:00p  ...   18846    NaN
3  Fri, Oct 30, 2015      7:30p  ...   16898    NaN
4  Fri, Oct 30, 2015      7:30p  ...   16035    NaN

[5 rows x 10 columns]

In [52]:
games = tables[0].rename(columns={
    'Date': 'date', 
    'Visitor/Neutral': 'away_team',
    'PTS': 'away_points',
    'Home/Neutral': 'home_team',
    'PTS.1': 'home_points'
})

games = games.drop(axis=1,labels=['Start (ET)','Unnamed: 6','Unnamed: 7','Attend.','Notes'])

games.head() #lookin good

                date              away_team  ...            home_team home_points
0  Fri, Oct 30, 2015              Utah Jazz  ...   Philadelphia 76ers          71
1  Fri, Oct 30, 2015             Miami Heat  ...  Cleveland Cavaliers         102
2  Fri, Oct 30, 2015  Oklahoma City Thunder  ...        Orlando Magic         136
3  Fri, Oct 30, 2015        Toronto Raptors  ...       Boston Celtics         103
4  Fri, Oct 30, 2015          Chicago Bulls  ...      Detroit Pistons          98

[5 rows x 5 columns]

In [53]:
#let's also make the dates into datetime objects. to hell with weekdays!
games['date'] = games['date'].apply(pd.to_datetime)

games.head()

        date              away_team  ...            home_team home_points
0 2015-10-30              Utah Jazz  ...   Philadelphia 76ers          71
1 2015-10-30             Miami Heat  ...  Cleveland Cavaliers         102
2 2015-10-30  Oklahoma City Thunder  ...        Orlando Magic         136
3 2015-10-30        Toronto Raptors  ...       Boston Celtics         103
4 2015-10-30          Chicago Bulls  ...      Detroit Pistons          98

[5 rows x 5 columns]

In [54]:
#extract the index to create an ID for each game
games = games.reset_index()

games.head()

   index       date  ...            home_team  home_points
0      0 2015-10-30  ...   Philadelphia 76ers           71
1      1 2015-10-30  ...  Cleveland Cavaliers          102
2      2 2015-10-30  ...        Orlando Magic          136
3      3 2015-10-30  ...       Boston Celtics          103
4      4 2015-10-30  ...      Detroit Pistons           98

[5 rows x 6 columns]

In [55]:
#rename that variable
games = games.rename(columns={"index":"game_id"})

games.head()

   game_id       date  ...            home_team  home_points
0        0 2015-10-30  ...   Philadelphia 76ers           71
1        1 2015-10-30  ...  Cleveland Cavaliers          102
2        2 2015-10-30  ...        Orlando Magic          136
3        3 2015-10-30  ...       Boston Celtics          103
4        4 2015-10-30  ...      Detroit Pistons           98

[5 rows x 6 columns]

In [56]:
#each row is half a game -- that is, the game id, date of game, and one of the two teams
tgames = pd.melt(games.reset_index(),
               id_vars=['game_id', 'date'], value_vars=['away_team', 'home_team'],
               value_name='team')
tgames.head()

   game_id       date   variable                   team
0        0 2015-10-30  away_team              Utah Jazz
1        1 2015-10-30  away_team             Miami Heat
2        2 2015-10-30  away_team  Oklahoma City Thunder
3        3 2015-10-30  away_team        Toronto Raptors
4        4 2015-10-30  away_team          Chicago Bulls

In [66]:
#I don't yet totally understand this line from the original blog post... 
#grouping by team and date makes sense, but the results are weird. 
#so many negative values!
tgames.groupby('team')['date'].diff().dt.days - 1

0     NaN
1     NaN
2     NaN
3     NaN
4     NaN
5     NaN
6     NaN
7     NaN
8     NaN
9     NaN
10    NaN
11    NaN
12    NaN
13    0.0
14    0.0
15    0.0
16    NaN
17    NaN
18    NaN
19    NaN
20    NaN
21    NaN
22    NaN
23    NaN
24   -3.0
25   -3.0
26   -4.0
27    NaN
28   -3.0
29    NaN
     ...
46    1.0
47    NaN
48   -2.0
49   -2.0
50    2.0
51    2.0
52    2.0
53    1.0
54    0.0
55    2.0
56   -3.0
57    0.0
58   -3.0
59   -2.0
60   -4.0
61   -5.0
62   -3.0
63   -4.0
64   -3.0
65   -3.0
66   -3.0
67   -3.0
68   -3.0
69   -3.0
70   -3.0
71   -4.0
72   -4.0
73   -3.0
74   -3.0
75   -3.0
Name: date, Length: 76, dtype: float64

In [72]:
#trying to apply this diff() business on a more manageable dataframe
cb = tgames[tgames['team'] =='Chicago Bulls']

cb.head()

    game_id       date   variable           team
4         4 2015-10-30  away_team  Chicago Bulls
25       25 2015-10-28  away_team  Chicago Bulls
59       21 2015-10-27  home_team  Chicago Bulls

In [75]:
cb['date'].diff().dt.days
#this provides the expected results, but in negative, since the dates are in reverse chronological order
#in addition, the difference isn't exactly the same as the days of rest, 
#since consecutive game days are one day apart but provide 0 rest days, etc.
#the original expression tried to account for this with -1, which is a problem when the value is negative

4     NaN
25   -2.0
59   -1.0
Name: date, dtype: float64

In [81]:
ggames = tgames.groupby('team')

ggames.head()
#not sure why neither groupby nor head seem to be acting as expected!

    game_id       date   variable                    team
0         0 2015-10-30  away_team               Utah Jazz
1         1 2015-10-30  away_team              Miami Heat
2         2 2015-10-30  away_team   Oklahoma City Thunder
3         3 2015-10-30  away_team         Toronto Raptors
4         4 2015-10-30  away_team           Chicago Bulls
5         5 2015-10-30  away_team      Washington Wizards
6         6 2015-10-30  away_team       Charlotte Hornets
7         7 2015-10-30  away_team           Brooklyn Nets
8         8 2015-10-30  away_team  Minnesota Timberwolves
9         9 2015-10-30  away_team   Golden State Warriors
10       10 2015-10-30  away_team      Los Angeles Lakers
11       11 2015-10-30  away_team  Portland Trail Blazers
12       12 2015-10-31  away_team         New York Knicks
13       13 2015-10-31  away_team               Utah Jazz
14       14 2015-10-31  away_team   Golden State Warriors
15       15 2015-10-31  away_team           Brooklyn Nets
16       16 2015-10-31  away_team            Phoenix Suns
17       17 2015-10-31  away_team        Sacramento Kings
18       18 2015-10-29  away_team       Memphis Grizzlies
19       19 2015-10-29  away_team           Atlanta Hawks
20       20 2015-10-29  away_team        Dallas Mavericks
21       21 2015-10-27  away_team     Cleveland Cavaliers
22       22 2015-10-27  away_team         Detroit Pistons
23       23 2015-10-27  away_team    New Orleans Pelicans
24       24 2015-10-28  away_team      Washington Wizards
25       25 2015-10-28  away_team           Chicago Bulls
26       26 2015-10-28  away_team               Utah Jazz
27       27 2015-10-28  away_team      Philadelphia 76ers
28       28 2015-10-28  away_team       Charlotte Hornets
29       29 2015-10-28  away_team          Indiana Pacers
..      ...        ...        ...                     ...
46        8 2015-10-30  home_team          Denver Nuggets
47        9 2015-10-30  home_team         Houston Rockets
48       10 2015-10-30  home_team        Sacramento Kings
49       11 2015-10-30  home_team            Phoenix Suns
50       12 2015-10-31  home_team      Washington Wizards
51       13 2015-10-31  home_team          Indiana Pacers
52       14 2015-10-31  home_team    New Orleans Pelicans
53       15 2015-10-31  home_team       Memphis Grizzlies
54       16 2015-10-31  home_team  Portland Trail Blazers
55       17 2015-10-31  home_team    Los Angeles Clippers
56       18 2015-10-29  home_team          Indiana Pacers
57       19 2015-10-29  home_team         New York Knicks
58       20 2015-10-29  home_team    Los Angeles Clippers
59       21 2015-10-27  home_team           Chicago Bulls
60       22 2015-10-27  home_team           Atlanta Hawks
61       23 2015-10-27  home_team   Golden State Warriors
62       24 2015-10-28  home_team           Orlando Magic
63       25 2015-10-28  home_team           Brooklyn Nets
64       26 2015-10-28  home_team         Detroit Pistons
65       27 2015-10-28  home_team          Boston Celtics
66       28 2015-10-28  home_team              Miami Heat
67       29 2015-10-28  home_team         Toronto Raptors
68       30 2015-10-28  home_team         Milwaukee Bucks
69       31 2015-10-28  home_team   Oklahoma City Thunder
70       32 2015-10-28  home_team         Houston Rockets
71       33 2015-10-28  home_team       Memphis Grizzlies
72       34 2015-10-28  home_team  Portland Trail Blazers
73       35 2015-10-28  home_team        Sacramento Kings
74       36 2015-10-28  home_team            Phoenix Suns
75       37 2015-10-28  home_team      Los Angeles Lakers

[76 rows x 4 columns]